//=============================================================================
// Сценарий загружает рекламу в верхнем левом углу сайта
//=============================================================================
//=============================================================================
// Функция возвращает случайное целое число в диапазоне от 0 до (n-1)
//=============================================================================
function GetRandomNum(n)
{
  var x = Math.round(Math.random() * n);
  if ((x > 0) && (x <= n)) {x = x - 1;}
  else {x = 0;}
  return x;
}
//=============================================================================
// Функия формирует на странице блок рекламы. Блок рекламы включает в себя
// таблицу с картинкой и ссылкой.
//=============================================================================
function ReklamaToScreen()         
{
//---Массив ссылок-------------------------------------------------------------
  var bd = new Array();
  
  bd[0] =  '<a href="http://av-mag.ru/nip/lety.htm" rel="nofollow" target="_blank">' +
           '<h1 style="color: blue;">Получи <b style="color:red;">200 рублей</b><br> на счёт за регистрацию</h1></a>';
           
  var Count = 1;                  //Количество элементов в массиве
  var Index;                      //Текущий элемент массива
  var DocWrite;                   //Ссылки
  
  Index = GetRandomNum(Count);
  DocWrite = bd[Index];    
  document.write(DocWrite);
}

ReklamaToScreen();
